In [1]:
import pandas as pd
import geopandas as gpd
import matplotlib.pyplot as plt

d:\workspace\python38\lib\site-packages\geopandas\_compat.py:123: UserWarning: The Shapely GEOS version (3.10.3-CAPI-1.16.1) is incompatible with the GEOS version PyGEOS was compiled with (3.10.4-CAPI-1.16.2). Conversions between both will be slow.
  warnings.warn(

In [2]:
zipfile=r"D:\GaoYunshu2023\100011 HK-Work\RA-project\001 Task description\Task1\Process\twitterPoint_final.shp"

In [3]:
df=gpd.read_file(zipfile)

In [4]:
df1=df[['OBJECTID_1','Field1','created_at','id_str','lang','time_zone','LanduseTyp','geometry']]
df2=pd.read_csv(r"D:\GaoYunshu2023\100011 HK-Work\RA-project\001 Task description\Task1\result_v2.csv")

C:\Users\GAOYUN~1\AppData\Local\Temp/ipykernel_3732/2164982482.py:2: DtypeWarning: Columns (7) have mixed types. Specify dtype option on import or set low_memory=False.
  df2=pd.read_csv(r"D:\GaoYunshu2023\100011 HK-Work\RA-project\001 Task description\Task1\result_v2.csv")

In [5]:
df2.rename(columns={df2.columns[0]: "Field1" }, inplace = True)

In [6]:
df3 = pd.merge(df1, df2, on='Field1', how='inner')

In [7]:
df3.head(5)

,OBJECTID_1,Field1,created_at_x,id_str_x,lang_x,time_zone_x,LanduseTyp,geometry,created_at_y,id_str_y,...,user_lang,user_url,verified,TPU_longitudinal,TPU_cross_sectional,cleaned_text,date,date_secondprocess,date_thirdprocess,date_hk
0,1,1246,Sun May 08 19:42:57 +0000 2016,7.290000e+17,en,Abu Dhabi,8,POINT (114.17800 22.28090),Sun May 08 19:42:57 +0000 2016,7.290000e+17,...,en,NaN,False,135,135,thanks again hong kong for more great to this ...,2016-05-08 19:42:57+00:00,5/8/2016 19:42,5/8/2016 19:42,5/8/2016 23:42
1,2,1254,Sun May 08 21:20:20 +0000 2016,7.290000e+17,en,Abu Dhabi,999,POINT (113.93337 22.31488),Sun May 08 21:20:20 +0000 2016,7.290000e+17,...,en,NaN,False,951,950 - 951,it s that time again u number u hong kong taxi...,2016-05-08 21:20:20+00:00,5/8/2016 21:20,5/8/2016 21:20,5/9/2016 1:20
2,3,3007,Thu May 12 08:04:44 +0000 2016,7.310000e+17,en,Abu Dhabi,8,POINT (114.17800 22.28090),Thu May 12 08:04:44 +0000 2016,7.310000e+17,...,en,NaN,False,135,135,static behaviour china hong kong explore touri...,2016-05-12 08:04:44+00:00,5/12/2016 8:04,5/12/2016 8:04,5/12/2016 12:04
3,4,3715,Fri May 13 09:07:09 +0000 2016,7.310000e+17,en,Abu Dhabi,7,POINT (114.20402 22.33934),Fri May 13 09:07:09 +0000 2016,7.310000e+17,...,en,NaN,False,281,281,the nan garden at diamond hill in hong kong a ...,2016-05-13 09:07:09+00:00,5/13/2016 9:07,5/13/2016 9:07,5/13/2016 13:07
4,5,4297,Sat May 14 06:37:43 +0000 2016,7.310000e+17,en,Abu Dhabi,3,POINT (114.04353 22.31342),Sat May 14 06:37:43 +0000 2016,7.310000e+17,...,en,NaN,False,973,971 - 974,advance birthday treat from my sister u number...,2016-05-14 06:37:43+00:00,5/14/2016 6:37,5/14/2016 6:37,5/14/2016 10:37

In [8]:
df3.dtypes

OBJECTID_1                int64
Field1                    int64
created_at_x             object
id_str_x                float64
lang_x                   object
time_zone_x              object
LanduseTyp                int64
geometry               geometry
created_at_y             object
id_str_y                float64
lang_y                   object
lat                     float64
lon                     float64
text                     object
time_zone_y              object
truncated                  bool
url                      object
user_created_at          object
user_id_str             float64
user_lang                object
user_url                 object
verified                   bool
TPU_longitudinal          int64
TPU_cross_sectional      object
cleaned_text             object
date                     object
date_secondprocess       object
date_thirdprocess        object
date_hk                  object
dtype: object

In [22]:
df3['date_hk'] = pd.to_datetime(df3['date_hk'])
df3['NEWdate_hk'] = pd.to_datetime(df3['date_hk']).dt.strftime('%Y-%m-%d-%H')
df3['day'] = df3['date_hk'].dt.day
df3['month'] = df3['date_hk'].dt.month
df3['year'] = df3['date_hk'].dt.year
df3['hour']=df3['date_hk'].dt.hour

In [33]:
df3.head(5)

,OBJECTID_1,Field1,created_at_x,id_str_x,lang_x,time_zone_x,LanduseTyp,geometry,created_at_y,id_str_y,...,cleaned_text,date,date_secondprocess,date_thirdprocess,date_hk,NEWdate_hk,day,month,year,hour
0,1,1246,Sun May 08 19:42:57 +0000 2016,7.290000e+17,en,Abu Dhabi,8,POINT (114.17800 22.28090),Sun May 08 19:42:57 +0000 2016,7.290000e+17,...,thanks again hong kong for more great to this ...,2016-05-08 19:42:57+00:00,5/8/2016 19:42,5/8/2016 19:42,2016-05-08 23:42:00,2016-05-08-23,8,5,2016,23
1,2,1254,Sun May 08 21:20:20 +0000 2016,7.290000e+17,en,Abu Dhabi,999,POINT (113.93337 22.31488),Sun May 08 21:20:20 +0000 2016,7.290000e+17,...,it s that time again u number u hong kong taxi...,2016-05-08 21:20:20+00:00,5/8/2016 21:20,5/8/2016 21:20,2016-05-09 01:20:00,2016-05-09-01,9,5,2016,1
2,3,3007,Thu May 12 08:04:44 +0000 2016,7.310000e+17,en,Abu Dhabi,8,POINT (114.17800 22.28090),Thu May 12 08:04:44 +0000 2016,7.310000e+17,...,static behaviour china hong kong explore touri...,2016-05-12 08:04:44+00:00,5/12/2016 8:04,5/12/2016 8:04,2016-05-12 12:04:00,2016-05-12-12,12,5,2016,12
3,4,3715,Fri May 13 09:07:09 +0000 2016,7.310000e+17,en,Abu Dhabi,7,POINT (114.20402 22.33934),Fri May 13 09:07:09 +0000 2016,7.310000e+17,...,the nan garden at diamond hill in hong kong a ...,2016-05-13 09:07:09+00:00,5/13/2016 9:07,5/13/2016 9:07,2016-05-13 13:07:00,2016-05-13-13,13,5,2016,13
4,5,4297,Sat May 14 06:37:43 +0000 2016,7.310000e+17,en,Abu Dhabi,3,POINT (114.04353 22.31342),Sat May 14 06:37:43 +0000 2016,7.310000e+17,...,advance birthday treat from my sister u number...,2016-05-14 06:37:43+00:00,5/14/2016 6:37,5/14/2016 6:37,2016-05-14 10:37:00,2016-05-14-10,14,5,2016,10

In [34]:
df3.dtypes

OBJECTID_1                      int64
Field1                          int64
created_at_x                   object
id_str_x                      float64
lang_x                         object
time_zone_x                    object
LanduseTyp                      int64
geometry                     geometry
created_at_y                   object
id_str_y                      float64
lang_y                         object
lat                           float64
lon                           float64
text                           object
time_zone_y                    object
truncated                        bool
url                            object
user_created_at                object
user_id_str                   float64
user_lang                      object
user_url                       object
verified                         bool
TPU_longitudinal                int64
TPU_cross_sectional            object
cleaned_text                   object
date                           object
date_secondprocess             object
date_thirdprocess              object
date_hk                datetime64[ns]
NEWdate_hk                     object
day                             int64
month                           int64
year                            int64
hour                            int64
dtype: object

In [35]:
df3.head(5)

,OBJECTID_1,Field1,created_at_x,id_str_x,lang_x,time_zone_x,LanduseTyp,geometry,created_at_y,id_str_y,...,cleaned_text,date,date_secondprocess,date_thirdprocess,date_hk,NEWdate_hk,day,month,year,hour
0,1,1246,Sun May 08 19:42:57 +0000 2016,7.290000e+17,en,Abu Dhabi,8,POINT (114.17800 22.28090),Sun May 08 19:42:57 +0000 2016,7.290000e+17,...,thanks again hong kong for more great to this ...,2016-05-08 19:42:57+00:00,5/8/2016 19:42,5/8/2016 19:42,2016-05-08 23:42:00,2016-05-08-23,8,5,2016,23
1,2,1254,Sun May 08 21:20:20 +0000 2016,7.290000e+17,en,Abu Dhabi,999,POINT (113.93337 22.31488),Sun May 08 21:20:20 +0000 2016,7.290000e+17,...,it s that time again u number u hong kong taxi...,2016-05-08 21:20:20+00:00,5/8/2016 21:20,5/8/2016 21:20,2016-05-09 01:20:00,2016-05-09-01,9,5,2016,1
2,3,3007,Thu May 12 08:04:44 +0000 2016,7.310000e+17,en,Abu Dhabi,8,POINT (114.17800 22.28090),Thu May 12 08:04:44 +0000 2016,7.310000e+17,...,static behaviour china hong kong explore touri...,2016-05-12 08:04:44+00:00,5/12/2016 8:04,5/12/2016 8:04,2016-05-12 12:04:00,2016-05-12-12,12,5,2016,12
3,4,3715,Fri May 13 09:07:09 +0000 2016,7.310000e+17,en,Abu Dhabi,7,POINT (114.20402 22.33934),Fri May 13 09:07:09 +0000 2016,7.310000e+17,...,the nan garden at diamond hill in hong kong a ...,2016-05-13 09:07:09+00:00,5/13/2016 9:07,5/13/2016 9:07,2016-05-13 13:07:00,2016-05-13-13,13,5,2016,13
4,5,4297,Sat May 14 06:37:43 +0000 2016,7.310000e+17,en,Abu Dhabi,3,POINT (114.04353 22.31342),Sat May 14 06:37:43 +0000 2016,7.310000e+17,...,advance birthday treat from my sister u number...,2016-05-14 06:37:43+00:00,5/14/2016 6:37,5/14/2016 6:37,2016-05-14 10:37:00,2016-05-14-10,14,5,2016,10

In [32]:
df1[df1['Field1']==84]

,OBJECTID_1,Field1,created_at,id_str,lang,time_zone,LanduseTyp,geometry
22262,22263,84,Sat May 07 08:25:21 +0000 2016,7.290000e+17,en,Auckland,999,POINT (114.18096 22.28066)

In [42]:
df4=df3[['OBJECTID_1','Field1','LanduseTyp','year','month','day','hour','NEWdate_hk','geometry']]

In [43]:
df5=pd.pivot_table(df4,index=['OBJECTID_1','Field1','year','month','day','hour','NEWdate_hk'],columns=['LanduseTyp'],aggfunc='count').fillna(0).astype(int)

In [44]:
df5.head(5)

                                                    geometry                  \
LanduseTyp                                               1   2   3   4   5
OBJECTID_1 Field1 year month day hour NEWdate_hk
1          1246   2016 5     8   23   2016-05-08-23        0   0   0   0   0
2          1254   2016 5     9   1    2016-05-09-01        0   0   0   0   0
3          3007   2016 5     12  12   2016-05-12-12        0   0   0   0   0
4          3715   2016 5     13  13   2016-05-13-13        0   0   0   0   0
5          4297   2016 5     14  10   2016-05-14-10        0   0   1   0   0


LanduseTyp                                          6   7   8   999
OBJECTID_1 Field1 year month day hour NEWdate_hk
1          1246   2016 5     8   23   2016-05-08-23   0   0   1   0
2          1254   2016 5     9   1    2016-05-09-01   0   0   0   1
3          3007   2016 5     12  12   2016-05-12-12   0   0   1   0
4          3715   2016 5     13  13   2016-05-13-13   0   1   0   0
5          4297   2016 5     14  10   2016-05-14-10   0   0   0   0

In [47]:
df5.dtypes

          LanduseTyp
geometry  1             int32
          2             int32
          3             int32
          4             int32
          5             int32
          6             int32
          7             int32
          8             int32
          999           int32
dtype: object

In [48]:
df5.head(5)

                                                    geometry                  \
LanduseTyp                                               1   2   3   4   5
OBJECTID_1 Field1 year month day hour NEWdate_hk
1          1246   2016 5     8   23   2016-05-08-23        0   0   0   0   0
2          1254   2016 5     9   1    2016-05-09-01        0   0   0   0   0
3          3007   2016 5     12  12   2016-05-12-12        0   0   0   0   0
4          3715   2016 5     13  13   2016-05-13-13        0   0   0   0   0
5          4297   2016 5     14  10   2016-05-14-10        0   0   1   0   0


LanduseTyp                                          6   7   8   999
OBJECTID_1 Field1 year month day hour NEWdate_hk
1          1246   2016 5     8   23   2016-05-08-23   0   0   1   0
2          1254   2016 5     9   1    2016-05-09-01   0   0   0   1
3          3007   2016 5     12  12   2016-05-12-12   0   0   1   0
4          3715   2016 5     13  13   2016-05-13-13   0   1   0   0
5          4297   2016 5     14  10   2016-05-14-10   0   0   0   0

In [56]:
df6=df5.groupby(['NEWdate_hk','year','month','day','hour']).sum()

In [57]:
df1.shape

(409626, 8)

In [58]:
df6.shape

(22086, 9)

In [59]:
df6.dtypes

          LanduseTyp
geometry  1             int32
          2             int32
          3             int32
          4             int32
          5             int32
          6             int32
          7             int32
          8             int32
          999           int32
dtype: object

In [62]:
df6.columns.values.tolist()

[('geometry', 1),
 ('geometry', 2),
 ('geometry', 3),
 ('geometry', 4),
 ('geometry', 5),
 ('geometry', 6),
 ('geometry', 7),
 ('geometry', 8),
 ('geometry', 999)]

In [64]:
df6.rename(columns={"'geometry', '1'": 'Villagetype'},inplace=True)

In [66]:
df6.dtypes

          LanduseTyp
geometry  1             int32
          2             int32
          3             int32
          4             int32
          5             int32
          6             int32
          7             int32
          8             int32
          999           int32
dtype: object

In [67]:
df6.to_csv(r'D:\GaoYunshu2023\100011 HK-Work\RA-project\001 Task description\0128_twitterPOI.csv')